cf_billing/Documents/бестИзменениеТиповСхемГВСМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзменениеТиповСхемГВСМКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргТипСхемыГВС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Строения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Строение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСхемыГВС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргТипыСхемТеплоснабжения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/бестИзменениеТиповСхемГВСМКД/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;  
	
	// ВводНаОсновании
	//ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	//ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// ОТЭК, 25.05.2020, 000202897.
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	энргОбщегоНазначенияКлиент.ПроверкаЗаполненияРайонаИОрганизации(ЭтаФорма, Объект, Отказ);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область СобытияИзмененийФормы

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииНаСервере();
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	// ОТЭК, 26.05.2020, 000202897.
	Объект.Строения.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
			ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	// ОТЭК, 26.05.2020, 000202897.
	Объект.Строения.Очистить();
	Объект.Район = ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура СтроенияСтроениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ОТЭК, 25.05.2020, 000202897.
	энргПользовательскийВводКлиент.отэкНачалоВыбораСтроения(Элемент, Объект.Организация, 
																Объект.Район, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
